25092023-2000-60-3/statistics.json
{
  "Get featured list by id" : {
    "transaction" : "Get featured list by id",
    "sampleCount" : 11982,
    "errorCount" : 9,
    "errorPct" : 0.07511267,
    "meanResTime" : 89862.63812385265,
    "medianResTime" : 91231.0,
    "minResTime" : 0.0,
    "maxResTime" : 107394.0,
    "pct1ResTime" : 96396.0,
    "pct2ResTime" : 98111.7,
    "pct3ResTime" : 99347.02,
    "throughput" : 4.986628245241228,
    "receivedKBytesPerSec" : 29.320023605147647,
    "sentKBytesPerSec" : 3.581446908764929
  },
  "Featured creators  - /users/feature/creator " : {
    "transaction" : "Featured creators  - /users/feature/creator ",
    "sampleCount" : 6000,
    "errorCount" : 4,
    "errorPct" : 0.06666667,
    "meanResTime" : 215086.4559999998,
    "medianResTime" : 211636.0,
    "minResTime" : 0.0,
    "maxResTime" : 232013.0,
    "pct1ResTime" : 227617.0,
    "pct2ResTime" : 228502.75,
    "pct3ResTime" : 229688.93,
    "throughput" : 2.3048706141673483,
    "receivedKBytesPerSec" : 15.78237344435639,
    "sentKBytesPerSec" : 1.5790434489238752
  },
  "Get products by categoryId" : {
    "transaction" : "Get products by categoryId",
    "sampleCount" : 23980,
    "errorCount" : 74,
    "errorPct" : 0.3085905,
    "meanResTime" : 104101.1548373647,
    "medianResTime" : 78880.5,
    "minResTime" : 0.0,
    "maxResTime" : 215159.0,
    "pct1ResTime" : 195617.80000000016,
    "pct2ResTime" : 206196.7,
    "pct3ResTime" : 208594.99,
    "throughput" : 8.420685952308297,
    "receivedKBytesPerSec" : 38.656427492161356,
    "sentKBytesPerSec" : 6.1320663926139565
  },
  "Products category  - products/digital/category/count" : {
    "transaction" : "Products category  - products/digital/category/count",
    "sampleCount" : 6000,
    "errorCount" : 5,
    "errorPct" : 0.083333336,
    "meanResTime" : 25680.75799999998,
    "medianResTime" : 25297.0,
    "minResTime" : 0.0,
    "maxResTime" : 30173.0,
    "pct1ResTime" : 27869.800000000003,
    "pct2ResTime" : 28253.95,
    "pct3ResTime" : 29091.949999999997,
    "throughput" : 2.411660862602857,
    "receivedKBytesPerSec" : 4.145754536710905,
    "sentKBytesPerSec" : 1.6801669118019449
  },
  "Featured list - products/digital/featured/list" : {
    "transaction" : "Featured list - products/digital/featured/list",
    "sampleCount" : 6000,
    "errorCount" : 9,
    "errorPct" : 0.15,
    "meanResTime" : 22598.53600000005,
    "medianResTime" : 23460.0,
    "minResTime" : 0.0,
    "maxResTime" : 27090.0,
    "pct1ResTime" : 25982.7,
    "pct2ResTime" : 26180.75,
    "pct3ResTime" : 26550.96,
    "throughput" : 2.7128158848029864,
    "receivedKBytesPerSec" : 3.368927449949677,
    "sentKBytesPerSec" : 1.8812110944053144
  },
  "Debug Sampler" : {
    "transaction" : "Debug Sampler",
    "sampleCount" : 41962,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.1521853105190399,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 13.695960895913373,
    "receivedKBytesPerSec" : 28.309455583045267,
    "sentKBytesPerSec" : 0.0
  },
  "Get cart  - /cart" : {
    "transaction" : "Get cart  - /cart",
    "sampleCount" : 6000,
    "errorCount" : 4,
    "errorPct" : 0.06666667,
    "meanResTime" : 26242.428666666692,
    "medianResTime" : 26387.0,
    "minResTime" : 375.0,
    "maxResTime" : 30563.0,
    "pct1ResTime" : 28244.9,
    "pct2ResTime" : 28814.95,
    "pct3ResTime" : 29360.989999999998,
    "throughput" : 2.4084846095826378,
    "receivedKBytesPerSec" : 2.476773615593011,
    "sentKBytesPerSec" : 1.6104122226780502
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 107924,
    "errorCount" : 109,
    "errorPct" : 0.100997,
    "meanResTime" : 50392.61657277405,
    "medianResTime" : 18328.5,
    "minResTime" : 0.0,
    "maxResTime" : 232013.0,
    "pct1ResTime" : 181404.50000000003,
    "pct2ResTime" : 186034.95,
    "pct3ResTime" : 205146.89,
    "throughput" : 35.177509132221395,
    "receivedKBytesPerSec" : 111.48840373096917,
    "sentKBytesPerSec" : 14.988211195576213
  },
  "Sign In Guest - /auth/guest/signin" : {
    "transaction" : "Sign In Guest - /auth/guest/signin",
    "sampleCount" : 6000,
    "errorCount" : 4,
    "errorPct" : 0.06666667,
    "meanResTime" : 21306.24499999995,
    "medianResTime" : 23205.0,
    "minResTime" : 373.0,
    "maxResTime" : 40906.0,
    "pct1ResTime" : 25369.9,
    "pct2ResTime" : 26073.95,
    "pct3ResTime" : 28916.909999999974,
    "throughput" : 2.7489305514767026,
    "receivedKBytesPerSec" : 4.46917048615295,
    "sentKBytesPerSec" : 1.5816354916943354
  }
}