jmeter.log
2023-10-05 14:59:36,969 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-10-05 14:59:36,994 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2023-10-05 14:59:36,995 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2023-10-05 14:59:36,995 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2023-10-05 14:59:36,995 INFO o.a.j.JMeter: Setting JMeter property: THREADS=1
2023-10-05 14:59:36,995 INFO o.a.j.JMeter: Setting JMeter property: RAMPUP=1
2023-10-05 14:59:36,995 INFO o.a.j.JMeter: Setting JMeter property: LOOPS=1
2023-10-05 14:59:37,013 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-10-05 14:59:37,013 INFO o.a.j.JMeter: Version 5.5
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: java.version=1.8.0_275
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: os.name=Linux
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: os.arch=amd64
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: os.version=5.10.16.3-microsoft-standard-WSL2
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: file.encoding=UTF-8
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: java.awt.headless=true
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: Max memory     =1937768448
2023-10-05 14:59:37,014 INFO o.a.j.JMeter: Available Processors =4
2023-10-05 14:59:37,024 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-10-05 14:59:37,025 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-10-05 14:59:37,025 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2023-10-05 14:59:37,025 INFO o.a.j.JMeter: user.dir  =/home/fnovello/desarrollo/stress-test
2023-10-05 14:59:37,025 INFO o.a.j.JMeter: PWD       =/home/fnovello/desarrollo/stress-test
2023-10-05 14:59:37,025 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 38c9f89a1058 FullName: 38c9f89a1058
2023-10-05 14:59:37,063 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1'
2023-10-05 14:59:37,066 INFO o.a.j.s.FileServer: Default base='/home/fnovello/desarrollo/stress-test'
2023-10-05 14:59:37,068 INFO o.a.j.s.FileServer: Set new base='/home/fnovello/desarrollo/stress-test'
2023-10-05 14:59:37,241 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-10-05 14:59:37,262 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-10-05 14:59:37,268 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-10-05 14:59:37,276 INFO o.a.j.s.SaveService: Loading file: /home/fnovello/desarrollo/stress-test/1-Scenario-Home-and-discover-nogui.jmx
2023-10-05 14:59:37,343 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 14:59:37,344 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 14:59:37,344 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 14:59:37,344 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 14:59:37,344 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2023-10-05 14:59:37,344 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2023-10-05 14:59:37,782 INFO o.a.j.JMeter: Creating summariser <summary>
2023-10-05 14:59:37,805 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2023-10-05 14:59:37,805 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1/reports/05102023-1-1-1.jtl
2023-10-05 14:59:37,805 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.5/bin/reportgenerator.properties
2023-10-05 14:59:37,805 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2023-10-05 14:59:37,811 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2023-10-05 14:59:37,823 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2023-10-05 14:59:37,824 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2023-10-05 14:59:37,831 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,833 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,833 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,833 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,833 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,833 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,834 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,835 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,835 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,835 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 14:59:37,836 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2023-10-05 14:59:37,836 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2023-10-05 14:59:37,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2023-10-05 14:59:37,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2023-10-05 14:59:37,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2023-10-05 14:59:37,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2023-10-05 14:59:37,847 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-10-05 14:59:37,848 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-10-05 14:59:37,848 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-10-05 14:59:37,875 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-10-05 14:59:37,875 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-10-05 14:59:38,361 INFO o.a.j.r.ResultCollector: Folder at /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1/reports was created
2023-10-05 14:59:38,380 INFO o.a.j.JMeter: Running test (1696510778376)
2023-10-05 14:59:38,460 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2023-10-05 14:59:38,461 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2023-10-05 14:59:38,461 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-10-05 14:59:38,461 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-10-05 14:59:38,469 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-10-05 14:59:38,469 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-10-05 14:59:38,473 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2023-10-05 14:59:43,062 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 38c9f89a1058
2023-10-05 14:59:43,069 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2023-10-05 14:59:43,071 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2023-10-05 14:59:43,071 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2023-10-05 14:59:43,071 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2023-10-05 14:59:43,071 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2023-10-05 15:00:01,972 INFO o.a.j.r.Summariser: summary +     10 in 00:00:24 =    0.4/s Avg:   206 Min:     0 Max:   458 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2023-10-05 15:00:18,307 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2023-10-05 15:00:18,307 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2023-10-05 15:00:18,309 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2023-10-05 15:00:18,310 INFO o.a.j.r.Summariser: summary +      8 in 00:00:16 =    0.5/s Avg:    81 Min:     0 Max:   219 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2023-10-05 15:00:18,310 INFO o.a.j.r.Summariser: summary =     18 in 00:00:40 =    0.5/s Avg:   151 Min:     0 Max:   458 Err:     0 (0.00%)
2023-10-05 15:00:18,311 INFO o.a.j.JMeter: Generating Dashboard
2023-10-05 15:00:18,311 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2023-10-05 15:00:18,327 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2023-10-05 15:00:18,410 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2023-10-05 15:00:18,410 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2023-10-05 15:00:18,412 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2023-10-05 15:00:18,413 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2023-10-05 15:00:18,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2023-10-05 15:00:18,422 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2023-10-05 15:00:18,422 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2023-10-05 15:00:18,422 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2023-10-05 15:00:18,435 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2023-10-05 15:00:18,435 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2023-10-05 15:00:18,436 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2023-10-05 15:00:18,436 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2023-10-05 15:00:18,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2023-10-05 15:00:18,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 126 samples
2023-10-05 15:00:18,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2023-10-05 15:00:18,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2023-10-05 15:00:18,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2023-10-05 15:00:18,440 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2023-10-05 15:00:18,441 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2023-10-05 15:00:18,441 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2023-10-05 15:00:18,447 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2023-10-05 15:00:18,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2023-10-05 15:00:18,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2023-10-05 15:00:18,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2023-10-05 15:00:18,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 270 samples
2023-10-05 15:00:18,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 54 samples
2023-10-05 15:00:18,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 18 samples
2023-10-05 15:00:18,449 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 18 samples produced in 84ms on channel 0
2023-10-05 15:00:18,449 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2023-10-05 15:00:18,651 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2023-10-05 15:00:18,652 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2023-10-05 15:00:18,653 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2023-10-05 15:00:18,656 INFO o.a.j.r.d.JsonExporter: Checking output folder
2023-10-05 15:00:18,657 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1/statistics.json
2023-10-05 15:00:18,720 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2023-10-05 15:00:18,724 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1
2023-10-05 15:00:18,915 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1, creating folder structure
2023-10-05 15:00:18,920 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.5/bin/report-template' to '/home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1', got message: /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1, found non empty folder with following content [/home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1/statistics.json, /home/fnovello/desarrollo/stress-test/reports/05102023-1-1-1/reports], will be ignored
2023-10-05 15:00:19,199 INFO o.a.j.JMeter: Dashboard generated