jmeter.log
2023-10-05 16:55:02,384 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-10-05 16:55:02,412 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2023-10-05 16:55:02,413 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2023-10-05 16:55:02,413 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2023-10-05 16:55:02,413 INFO o.a.j.JMeter: Setting JMeter property: THREADS=1
2023-10-05 16:55:02,413 INFO o.a.j.JMeter: Setting JMeter property: RAMPUP=1
2023-10-05 16:55:02,413 INFO o.a.j.JMeter: Setting JMeter property: LOOPS=1
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: Version 5.5
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: java.version=1.8.0_275
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: os.name=Linux
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: os.arch=amd64
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: os.version=5.10.16.3-microsoft-standard-WSL2
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: file.encoding=UTF-8
2023-10-05 16:55:02,431 INFO o.a.j.JMeter: java.awt.headless=true
2023-10-05 16:55:02,432 INFO o.a.j.JMeter: Max memory     =1929379840
2023-10-05 16:55:02,432 INFO o.a.j.JMeter: Available Processors =4
2023-10-05 16:55:02,443 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-10-05 16:55:02,444 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-10-05 16:55:02,444 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2023-10-05 16:55:02,444 INFO o.a.j.JMeter: user.dir  =/home/fnovello/desarrollo/stress-test
2023-10-05 16:55:02,444 INFO o.a.j.JMeter: PWD       =/home/fnovello/desarrollo/stress-test
2023-10-05 16:55:02,445 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 46a6dd371bcc FullName: 46a6dd371bcc
2023-10-05 16:55:02,475 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1'
2023-10-05 16:55:02,479 INFO o.a.j.s.FileServer: Default base='/home/fnovello/desarrollo/stress-test'
2023-10-05 16:55:02,480 INFO o.a.j.s.FileServer: Set new base='/home/fnovello/desarrollo/stress-test'
2023-10-05 16:55:02,655 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-10-05 16:55:02,681 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-10-05 16:55:02,687 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-10-05 16:55:02,695 INFO o.a.j.s.SaveService: Loading file: /home/fnovello/desarrollo/stress-test/2-Scenario-Cart-as-guest-nogui.jmx
2023-10-05 16:55:02,762 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 16:55:02,762 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 16:55:02,762 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 16:55:02,762 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-10-05 16:55:02,762 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2023-10-05 16:55:02,762 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2023-10-05 16:55:03,208 INFO o.a.j.JMeter: Creating summariser <summary>
2023-10-05 16:55:03,222 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2023-10-05 16:55:03,223 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1/reports/05102023cartasguest-1-1-1.jtl
2023-10-05 16:55:03,223 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.5/bin/reportgenerator.properties
2023-10-05 16:55:03,224 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2023-10-05 16:55:03,230 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2023-10-05 16:55:03,235 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2023-10-05 16:55:03,235 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2023-10-05 16:55:03,236 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2023-10-05 16:55:03,236 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2023-10-05 16:55:03,236 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2023-10-05 16:55:03,236 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2023-10-05 16:55:03,236 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2023-10-05 16:55:03,236 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2023-10-05 16:55:03,242 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,243 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,244 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,244 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-10-05 16:55:03,245 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2023-10-05 16:55:03,245 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2023-10-05 16:55:03,245 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2023-10-05 16:55:03,245 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2023-10-05 16:55:03,246 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2023-10-05 16:55:03,246 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2023-10-05 16:55:03,267 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-10-05 16:55:03,268 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-10-05 16:55:03,268 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-10-05 16:55:03,275 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-10-05 16:55:03,277 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-10-05 16:55:04,198 INFO o.a.j.r.ResultCollector: Folder at /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1/reports was created
2023-10-05 16:55:04,206 INFO o.a.j.JMeter: Running test (1696517704206)
2023-10-05 16:55:04,320 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2023-10-05 16:55:04,320 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2023-10-05 16:55:04,320 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-10-05 16:55:04,320 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-10-05 16:55:04,338 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-10-05 16:55:04,339 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-10-05 16:55:04,361 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2023-10-05 16:55:04,412 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 46a6dd371bcc
2023-10-05 16:55:04,422 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2023-10-05 16:55:04,425 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2023-10-05 16:55:04,425 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2023-10-05 16:55:04,426 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2023-10-05 16:55:04,426 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2023-10-05 16:55:05,095 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.1/s Avg:   511 Min:   511 Max:   511 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2023-10-05 16:55:12,240 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2023-10-05 16:55:12,240 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2023-10-05 16:55:12,241 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2023-10-05 16:55:12,242 INFO o.a.j.r.Summariser: summary +     10 in 00:00:07 =    1.4/s Avg:   526 Min:   377 Max:  1255 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2023-10-05 16:55:12,242 INFO o.a.j.r.Summariser: summary =     11 in 00:00:08 =    1.4/s Avg:   524 Min:   377 Max:  1255 Err:     0 (0.00%)
2023-10-05 16:55:12,243 INFO o.a.j.JMeter: Generating Dashboard
2023-10-05 16:55:12,243 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2023-10-05 16:55:12,285 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2023-10-05 16:55:12,371 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2023-10-05 16:55:12,371 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2023-10-05 16:55:12,375 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2023-10-05 16:55:12,375 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2023-10-05 16:55:12,384 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2023-10-05 16:55:12,473 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2023-10-05 16:55:12,474 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2023-10-05 16:55:12,474 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2023-10-05 16:55:12,496 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2023-10-05 16:55:12,496 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2023-10-05 16:55:12,497 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2023-10-05 16:55:12,497 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2023-10-05 16:55:12,535 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2023-10-05 16:55:12,535 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 77 samples
2023-10-05 16:55:12,535 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2023-10-05 16:55:12,535 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2023-10-05 16:55:12,535 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2023-10-05 16:55:12,536 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2023-10-05 16:55:12,536 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2023-10-05 16:55:12,536 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2023-10-05 16:55:12,538 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2023-10-05 16:55:12,539 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2023-10-05 16:55:12,539 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2023-10-05 16:55:12,539 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2023-10-05 16:55:12,539 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 165 samples
2023-10-05 16:55:12,539 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 33 samples
2023-10-05 16:55:12,539 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 11 samples
2023-10-05 16:55:12,540 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 11 samples produced in 208ms on channel 0
2023-10-05 16:55:12,541 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2023-10-05 16:55:12,789 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2023-10-05 16:55:12,790 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2023-10-05 16:55:12,791 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2023-10-05 16:55:12,791 INFO o.a.j.r.d.JsonExporter: Checking output folder
2023-10-05 16:55:12,792 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1/statistics.json
2023-10-05 16:55:12,874 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2023-10-05 16:55:12,879 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1
2023-10-05 16:55:13,044 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1, creating folder structure
2023-10-05 16:55:13,048 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.5/bin/report-template' to '/home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1', got message: /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1, found non empty folder with following content [/home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1/statistics.json, /home/fnovello/desarrollo/stress-test/reports/05102023cartasguest-1-1-1/reports], will be ignored
2023-10-05 16:55:13,415 INFO o.a.j.JMeter: Dashboard generated